# Importing Data from the Web with pd.read_html()

### Import de bibliotecas

In [1]:
import pandas as pd

In [2]:
url='https://en.wikipedia.org/wiki/1976_Summer_Olympics_medal_table'

In [6]:
wik_1976 = pd.read_html(url)[1]

In [7]:
wik_1976.head()

  Rank                  NOC  Gold  Silver  Bronze  Total
0    1   Soviet Union (URS)    49      41      35    125
1    2   East Germany (GDR)    40      25      25     90
2    3  United States (USA)    34      35      25     94
3    4   West Germany (FRG)    10      12      17     39
4    5          Japan (JPN)     9       6      10     25

In [8]:
wik_1976.tail()

                Rank                NOC  Gold  Silver  Bronze  Total
37                37      Bermuda (BER)     0       0       1      1
38                37     Pakistan (PAK)     0       0       1      1
39                37  Puerto Rico (PUR)     0       0       1      1
40                37     Thailand (THA)     0       0       1      1
41  Totals (41 NOCs)   Totals (41 NOCs)   198     199     216    613

In [9]:
url2='https://en.wikipedia.org/wiki/2020_Summer_Olympics_medal_table'

In [17]:
wik_2020 = pd.read_html(url2)[2]

In [18]:
wik_2020.head()

  Rank                 Team  Gold  Silver  Bronze  Total
0    1  United States (USA)    39      41      33    113
1    2          China (CHN)    38      32      18     88
2    3         Japan (JPN)*    27      14      17     58
3    4  Great Britain (GBR)    22      21      22     65
4    5            ROC (ROC)    20      28      23     71

In [19]:
wik_2020.tail()

                 Rank               Team  Gold  Silver  Bronze  Total
89                 86  Ivory Coast (CIV)     0       0       1      1
90                 86       Kuwait (KUW)     0       0       1      1
91                 86      Moldova (MDA)     0       0       1      1
92                 86        Syria (SYR)     0       0       1      1
93  Totals (93 teams)  Totals (93 teams)   340     338     402   1080

In [20]:
wik_1976.to_csv('wik_1976.csv', index=False)

In [21]:
wik_2020.to_csv('wik_2020.csv', index=False)